var questions = [
    {
        "question":"你現在對自己的2018年非常樂觀？",
        "answers":[
            ["是的",2],
            ["不是",3],
            ["不知道",4]
        ]
    },
    {
        "question":"你覺得自己是不是越來越不可靠了？",
        "answers":[
            ["是的",3],
            ["不是",4],
            ["一般",5]
        ]
    },
    {
        "question":"想到新的一年來到，就非常開心？",
        "answers":[
            ["是的",4],
            ["不是",5],
            ["還好",6]
        ]
    },
    {
        "question":"如果給你五百萬要你離開很愛的戀人，你會？",
        "answers":[
            ["好的",5],
            ["都可以",6],
            ["不要",7]
        ]
    },
    {
        "question":"過去一年裡，你有沒有受到很大的打擊？",
        "answers":[
            ["有的",6],
            ["沒有",7],
            ["還在承受著呢",8]
        ]
    },
    {
        "question":"你喜歡下面哪一個形容天氣的詞？",
        "answers":[
            ["風和日麗",7],
            ["豔陽高照",8],
            ["秋高氣爽","A"]
        ]
    },
    {
        "question":"你覺得自己一直是比較不一般的？",
        "answers":[
            ["是的",8],
            ["不是",9],
            ["不知道",10]
        ]
    },
    {
        "question":"你會想要跟情人去哪裡旅行？",
        "answers":[
            ["蔚藍海岸",9],
            ["山林湖畔","A"],
            ["歷史古鎮","B"]
        ]
    },
    {
        "question":"除了愛情，你更希望2018年實現哪件事情？",
        "answers":[
            ["買房子","C"],
            ["工作升遷","D"],
            ["變帥變美","A"]
        ]
    },
    {
        "question":"下面哪一種飲料中獎，你最想要？",
        "answers":[
            ["優格再來一瓶","B"],
            ["啤酒再來一瓶","C"],
            ["紅茶再來一瓶","D"]
        ]
    }
    
];

var finalAnswers={
        "A":["France Paris","遊走花都巴黎，奢華三宮、葡萄酒莊秘尋，夜宿皇家城堡旅館，品味米其林頂級料理！南法普羅旺斯、北法及法瑞！"],
        "B":["England London","跟著凱特王妃的腳步，親臨溫莎古堡，倫敦塔，威爾斯，劍橋牛津，收集日不落風采。溫莎古堡、倫敦塔、愛丁堡、蒸汽火車、莎士比亞！"],
        "C":["Japan Kyoto","日本特有的風俗與生活美學全在京都這個千年古都流傳了下來，神社寺院、和服舞妓穿梭的小徑、嵐山竹林等。來京都旅遊就可以感受到充滿人文氣息的城市！"],
        "D":["Taiwan Taipei","存錢以後再出國！"]
};

